app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$g.g6lAld52rEfGgFP6aQEeQnfoS0ByX4xLq68xnjfwbBbJ7jzXnRO"], ["updated_at", "2021-08-15 04:12:02.435253"], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)