app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", "FILL_IN"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "FILL_IN"]]
---
  def index
    @users = User.where(activated: "FILL_IN").paginate(page: params[:page])